mediumPurdue/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
libs            (waveModels);
application     waveFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.1;
maxAlphaCo      1;
maxDeltaT       0.1;

functions
{
    forces1
    {
    type            forces;
    libs            ("libforces.so");
    patches         (floatingObject);
    enabled         true;
    writeControl    timeStep;
    writeInterval   1;


    rho         rhoInf;  
    rhoInf      1000; 
    CofR	(0 0 0);
   }  
}
