mediumPurdue/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
wave_height 	12 ;
stillWaterLevel	30;
#include "blockMeshDict" //Include global variables
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    monopile.stl
    {
        type    triSurfaceMesh;
        name    floatingObject ;
        
    }
    
    FS_1
    {
        type    searchableBox;
        min     ($xmin  #eval "$ymin" #eval "-5*$wave_height+$stillWaterLevel");
        max     ($xmax  #eval "$ymax" #eval "3*$wave_height+$stillWaterLevel" );
    }
    FS_2
    {
        type    searchableBox;
        min     ($xmin  #eval "$ymin" #eval "-4*$wave_height+$stillWaterLevel");
        max     ($xmax  #eval "$ymax" #eval "2*$wave_height+$stillWaterLevel" );
    }
    FS_3
    {
        type    searchableBox;
        min     ($xmin  #eval "$ymin" #eval "-1.5*$wave_height+$stillWaterLevel");
        max     ($xmax  #eval "$ymax" #eval "1.5*$wave_height+$stillWaterLevel" );
    }
    
    

};

castellatedMeshControls
{
    maxLocalCells   200000000;
    maxGlobalCells  300000000;
    minRefinementCells 20;
    nCellsBetweenLevels 2;
    maxLoadUnbalance 0.1;
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle     30;
    features
    (
        {
            file "monopile.eMesh" ;
            level 6 ;
        }
    );

    refinementSurfaces
    {
        
        floatingObject
        {
            level (6 6);
            
        }
    }

    refinementRegions
    {
	FS_1
        {
            mode inside;
            levels ((1e-5 1)); //First entry here is distance, which will be ignored unless mode = distance
        }
        FS_2
        {
            mode inside;
            levels ((1e-5 2)); //First entry here is distance, which will be ignored unless mode = distance
        }
        FS_3
        {
            mode inside;
            levels ((1e-5 3)); //First entry here is distance, which will be ignored unless mode = distance
        }
        
	}
    locationInMesh (0 0 100) ;
}

snapControls
{
    tolerance       1;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    detectNearSurfacesSnap true;
    nSmoothPatch    5;
    nSolveIter      50;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    nSmoothInternal 3;
    nFaceSplitInterval 5;
}

addLayersControls
{
    layers
    {
        floatingObject
        {
            nSurfaceLayers 4;
        }
        /*bottom
        {
            nSurfaceLayers 4;
        }*/
    }
    relativeSizes    true ;
    expansionRatio    1.2 ;
    finalLayerThickness   0.7 ;
    featureAngle    180;
    slipFeatureAngle 30;
    nGrow           0;
    nBufferCellsNoExtrude 0;
    minMedialAxisAngle 90;
    maxFaceThicknessRatio 0.2;
    maxThicknessToMedialRatio 0.3;
    minThickness    0.1;
    nLayerIter      150;
    nRelaxIter      14;
    nSmoothSurfaceNormals 10;
    nSmoothNormals  5;
    nSmoothThickness 10;
    nRelaxedIter    10;
    nMedialAxisIter 10;
}

meshQualityControls
{
    minVol          1e-20;
    minTetQuality   1e-20;
    minArea         1e-20;
    minTwist        0.05;
    minDeterminant  1e-06;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;
    minFlatness     0.5;
    maxNonOrtho     70;
    maxBoundarySkewness 5;
    maxInternalSkewness 4;
    maxConcave      80;
    nSmoothScale    4;
    errorReduction  0.75;

    relaxed
    {
        minVol          1e-30;
        minTetQuality   1e-30;
        minArea         1e-30;
        minTwist        0.001;
        minDeterminant  1e-06;
        minFaceWeight   1e-06;
        minVolRatio     0.01;
        minTriangleTwist -1;
        minFlatness     0.5;
        maxNonOrtho     75;
        maxBoundarySkewness 10;
        maxInternalSkewness 8;
        maxConcave      80;
        nSmoothScale    4;
        errorReduction  0.75;
    }
}


mergeTolerance  1e-06;

debug           0;


// ************************************************************************* //
