mediumPurdue/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            30;

seaLevelAsReference true;

relaxationNames     ( inlet outlet );

initializationName  inlet;

inletCoeffs
{
    waveType            irregular;
    spectrum            newWaveJONSWAP;
    N                   50;
    Tsoft               0;
    etaMax              12;
    Tp                  9;
    gamma               1;
    depth               30;
    direction           ( 1 0 0 );
    amplitude           nonuniform List<scalar>
    50
    (
        2.0847e-33
        1.13456e-18
        3.29202e-11
        3.85943e-07
        8.56901e-05
        0.00226905
        0.0184576
        0.074029
...
    );
    frequency           nonuniform List<scalar>
    50
    (
        0.0363333
        0.0423333
        0.0483333
        0.0543333
        0.0603333
        0.0663333
        0.0723333
        0.0783333
...
    );
    phaselag            nonuniform List<scalar>
    50
    (
        -0.684867
        -0.797965
        -0.911062
        -1.02416
        -1.13726
        -1.25035
        -1.36345
        -1.47655
...
    );
    waveNumber          nonuniform List<vector>
    50
    (
        (0.0136713 0 0)
        (0.0160866 0 0)
        (0.0185788 0 0)
        (0.0211621 0 0)
        (0.0238522 0 0)
        (0.0266664 0 0)
        (0.029624 0 0)
        (0.032746 0 0)
...
    );

    frequencyAxis
    {
        discretisation      equidistantFrequencyAxis;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( -60 0 0 );
        endX                ( -10 0 150 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            irregular;
    spectrum            newWaveJONSWAP;
    N                   50;
    Tsoft               0;
    etaMax              12;
    Tp                  9;
    gamma               1;
    depth               30;
    direction           ( 1 0 0 );
    amplitude           nonuniform List<scalar>
    50
    (
        2.0847e-33
        1.13456e-18
        3.29202e-11
        3.85943e-07
        8.56901e-05
        0.00226905
        0.0184576
        0.074029
...
    );
    frequency           nonuniform List<scalar>
    50
    (
        0.0363333
        0.0423333
        0.0483333
        0.0543333
        0.0603333
        0.0663333
        0.0723333
        0.0783333
...
    );
    phaselag            nonuniform List<scalar>
    50
    (
        -6.84867
        -7.97965
        -9.11062
        -10.2416
        -11.3726
        -12.5035
        -13.6345
        -14.7655
...
    );
    waveNumber          nonuniform List<vector>
    50
    (
        (0.0136713 0 0)
        (0.0160866 0 0)
        (0.0185788 0 0)
        (0.0211621 0 0)
        (0.0238522 0 0)
        (0.0266664 0 0)
        (0.029624 0 0)
        (0.032746 0 0)
...
    );

    frequencyAxis
    {
        discretisation      equidistantFrequencyAxis;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 40 0 0 );
        endX                ( 80 0 150 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
