mediumPurdue/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	30;
seaLevelAsReference true;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet outlet);

initializationName inlet;

inletCoeffs
{
   waveType    irregular;
    spectrum    newWaveJONSWAP;

    N           50;
    Tsoft       0.0;
    
    etaMax      12;
    Tp          9;
    gamma       1.0;

    depth       30;
    direction   (1 0 0);

    phaseMethod focusingPhase;
    focusTime   3;
    focusPoint  (0.0 0 0);

    frequencyAxis
    {
        discretisation equidistantFrequencyAxis;
    }

    

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;
    
        relaxType   INLET;
        startX      (-60 0.0 0);
        endX        (-10 0.0  150);
        orientation      (1.0 0.0 0.0);
    }
};


outletCoeffs
{
    waveType    irregular;
    spectrum    newWaveJONSWAP;

    N           50;
    Tsoft       0.0;
    
    etaMax      12;
    Tp          9;
    gamma       1.0;

    depth       30;
    direction   (1 0 0);

    phaseMethod focusingPhase;
    focusTime   30;
    focusPoint  (0.0 0 0);

    frequencyAxis
    {
        discretisation equidistantFrequencyAxis;
    }

    
    
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   OUTLET;
        startX      (40 0.0    0);
        endX        (80 0.0  150);
        orientation      (1.0 0.0 0.0);
    }
};



// ************************************************************************* //
