mediumPurdue/system/clean.sh
#!/bin/sh
set -e -u

. ../../tools/cleaning-tools.sh

clean_openfoam .
rm -fv 0/alpha.water
