mediumPurdue/system/displacementProbe
#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type		probes;

probeLocations
(
	(0 0 30)
);

fields
(
	cellDisplacement
);
